In [ ]:
from pyspark.sql import SparkSession

spark=SparkSession.builder\
.appName("Exercise1")\
.getOrCreate()
spark.version

'4.0.1'

#DATASET: Retail Customer Dataset (30
Records)

In [ ]:
data = [
("C001", "Arjun", "Hyderabad", 25, 45000, "Electronics"),
("C002", "Meera", "Chennai", 32, 52000, "Grocery"),
("C003", "Rajesh", "Bangalore", 29, 61000, "Clothing"),
("C004", "Priya", "Delhi", 22, 38000, "Grocery"),
("C005", "Sanjay", "Mumbai", 35, 72000, "Electronics"),
("C006", "Kavya", "Hyderabad", 28, 48000, "Grocery"),
("C007", "Imran", "Delhi", 31, 53000, "Clothing"),
("C008", "Divya", "Chennai", 27, 45000, "Electronics"),
("C009", "Anil", "Bangalore", 40, 85000, "Furniture"),
("C010", "Ritu", "Mumbai", 23, 39000, "Clothing"),
("C011", "Hari", "Hyderabad", 33, 56000, "Grocery"),
("C012", "Sana", "Delhi", 26, 47000, "Electronics"),
("C013", "Vikram", "Chennai", 38, 91000, "Furniture"),
("C014", "Deepa", "Mumbai", 30, 62000, "Clothing"),
("C015", "Asha", "Bangalore", 24, 41000, "Grocery"),
("C016", "Kiran", "Delhi", 29, 59000, "Furniture"),
("C017", "Farah", "Hyderabad", 36, 70000, "Clothing"),
("C018", "Tarun", "Chennai", 28, 53000, "Furniture"),
("C019", "Nisha", "Mumbai", 21, 35000, "Grocery"),
("C020", "Yusuf", "Bangalore", 34, 76000, "Electronics"),
("C021", "Pooja", "Delhi", 27, 47000, "Clothing"),
("C022", "Zara", "Hyderabad", 32, 58000, "Grocery"),
("C023", "Ajay", "Chennai", 30, 51000, "Furniture"),
("C024", "Reema", "Bangalore", 28, 49000, "Clothing"),
("C025", "Gautam", "Mumbai", 39, 82000, "Furniture"),
("C026", "Swati", "Delhi", 25, 46000, "Electronics"),
("C027", "Mahesh", "Hyderabad", 41, 90000, "Furniture"),
("C028", "Anita", "Chennai", 26, 44000, "Clothing"),
("C029", "Sameer", "Bangalore", 33, 68000, "Electronics"),
("C030", "Leela", "Delhi", 22, 36000, "Grocery")
]

columns = ["customer_id", "name", "city", "age", "annual_spend", "category"]
df=spark.createDataFrame(data,columns)
df.show()

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend|   category|
+-----------+------+---------+---+------------+-----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|
|       C008| Divya|  Chennai| 27|       45000|Electronics|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|
+-----------+------+---------+---+------------+-----------+
only showing top 20 rows

#Show the first 10 customers.

In [ ]:
df.show(10)

+-----------+------+---------+---+------------+-----------+
|customer_id|  name|     city|age|annual_spend|   category|
+-----------+------+---------+---+------------+-----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|
|       C008| Divya|  Chennai| 27|       45000|Electronics|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|
+-----------+------+---------+---+------------+-----------+
only showing top 10 rows

In [ ]:
df.select("name").show(10)

+------+
|  name|
+------+
| Arjun|
| Meera|
|Rajesh|
| Priya|
|Sanjay|
| Kavya|
| Imran|
| Divya|
|  Anil|
|  Ritu|
+------+
only showing top 10 rows

#List all unique cities.

In [ ]:
df.select("city").distinct().show()

+---------+
|     city|
+---------+
|Bangalore|
|  Chennai|
|   Mumbai|
|    Delhi|
|Hyderabad|
+---------+

#Display only customer_id, name, and annual_spend columns.

In [ ]:
df.select("customer_id","name","annual_spend").show(30)

+-----------+------+------------+
|customer_id|  name|annual_spend|
+-----------+------+------------+
|       C001| Arjun|       45000|
|       C002| Meera|       52000|
|       C003|Rajesh|       61000|
|       C004| Priya|       38000|
|       C005|Sanjay|       72000|
|       C006| Kavya|       48000|
|       C007| Imran|       53000|
|       C008| Divya|       45000|
|       C009|  Anil|       85000|
|       C010|  Ritu|       39000|
|       C011|  Hari|       56000|
|       C012|  Sana|       47000|
|       C013|Vikram|       91000|
|       C014| Deepa|       62000|
|       C015|  Asha|       41000|
|       C016| Kiran|       59000|
|       C017| Farah|       70000|
|       C018| Tarun|       53000|
|       C019| Nisha|       35000|
|       C020| Yusuf|       76000|
|       C021| Pooja|       47000|
|       C022|  Zara|       58000|
|       C023|  Ajay|       51000|
|       C024| Reema|       49000|
|       C025|Gautam|       82000|
|       C026| Swati|       46000|
|       C027|Mahesh|       90000|
|       C028| Anita|       44000|
|       C029|Sameer|       68000|
|       C030| Leela|       36000|
+-----------+------+------------+

#Filter all customers who spend more than 60000 annually.

In [ ]:
df.filter(df.annual_spend>60000).select("Customer_id","name").show(30)

+-----------+------+
|Customer_id|  name|
+-----------+------+
|       C003|Rajesh|
|       C005|Sanjay|
|       C009|  Anil|
|       C013|Vikram|
|       C014| Deepa|
|       C017| Farah|
|       C020| Yusuf|
|       C025|Gautam|
|       C027|Mahesh|
|       C029|Sameer|
+-----------+------+

#Show all customers from Delhi who are younger than 30.

In [ ]:
df.filter((df.age<30) & (df.city=="Delhi")).select("name").show()

+-----+
| name|
+-----+
|Priya|
| Sana|
|Kiran|
|Pooja|
|Swati|
|Leela|
+-----+

#Create a new column named "spend_lakh" = annual_spend / 100000.

In [20]:
from pyspark.sql.functions import col
df2=df.withColumn("spend_lakh",col("age")/100000)
df2.show()

+-----------+------+---------+---+------------+-----------+----------+
|customer_id|  name|     city|age|annual_spend|   category|spend_lakh|
+-----------+------+---------+---+------------+-----------+----------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|    2.5E-4|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|    3.2E-4|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|    2.9E-4|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|    2.2E-4|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|    3.5E-4|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|    2.8E-4|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|    3.1E-4|
|       C008| Divya|  Chennai| 27|       45000|Electronics|    2.7E-4|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|    4.0E-4|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|    2.3E-4|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|    3.3E-4|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|    2.6E-4|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|    3.8E-4|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|    3.0E-4|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|    2.4E-4|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|    2.9E-4|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|    3.6E-4|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|    2.8E-4|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|    2.1E-4|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|    3.4E-4|
+-----------+------+---------+---+------------+-----------+----------+
only showing top 20 rows

#Create a new column "customer_type"

In [23]:
from pyspark.sql.functions import when, col

df = df.withColumn("customer_type",
                   when(col("annual_spend") > 70000, "Premium")
                   .otherwise("Standard"))
df.show(30)

+-----------+------+---------+---+------------+-----------+-------------+
|customer_id|  name|     city|age|annual_spend|   category|customer_type|
+-----------+------+---------+---+------------+-----------+-------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     Standard|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|     Standard|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     Standard|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|     Standard|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|      Premium|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|     Standard|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|     Standard|
|       C008| Divya|  Chennai| 27|       45000|Electronics|     Standard|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|      Premium|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|     Standard|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|     Standard|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|     Standard|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|      Premium|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|     Standard|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|     Standard|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|     Standard|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     Standard|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|     Standard|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|     Standard|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      Premium|
|       C021| Pooja|    Delhi| 27|       47000|   Clothing|     Standard|
|       C022|  Zara|Hyderabad| 32|       58000|    Grocery|     Standard|
|       C023|  Ajay|  Chennai| 30|       51000|  Furniture|     Standard|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|     Standard|
|       C025|Gautam|   Mumbai| 39|       82000|  Furniture|      Premium|
|       C026| Swati|    Delhi| 25|       46000|Electronics|     Standard|
|       C027|Mahesh|Hyderabad| 41|       90000|  Furniture|      Premium|
|       C028| Anita|  Chennai| 26|       44000|   Clothing|     Standard|
|       C029|Sameer|Bangalore| 33|       68000|Electronics|     Standard|
|       C030| Leela|    Delhi| 22|       36000|    Grocery|     Standard|
+-----------+------+---------+---+------------+-----------+-------------+

#Show customers whose name starts with the letter A.

In [24]:
df.filter(df.name.startswith("A")).show()

+-----------+-----+---------+---+------------+-----------+-------------+
|customer_id| name|     city|age|annual_spend|   category|customer_type|
+-----------+-----+---------+---+------------+-----------+-------------+
|       C001|Arjun|Hyderabad| 25|       45000|Electronics|     Standard|
|       C009| Anil|Bangalore| 40|       85000|  Furniture|      Premium|
|       C015| Asha|Bangalore| 24|       41000|    Grocery|     Standard|
|       C023| Ajay|  Chennai| 30|       51000|  Furniture|     Standard|
|       C028|Anita|  Chennai| 26|       44000|   Clothing|     Standard|
+-----------+-----+---------+---+------------+-----------+-------------+

#Filter customers where category is either Clothing or Electronics.

In [25]:
df.filter(df.category.isin("Clothing", "Electronics")).show()

+-----------+------+---------+---+------------+-----------+-------------+
|customer_id|  name|     city|age|annual_spend|   category|customer_type|
+-----------+------+---------+---+------------+-----------+-------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     Standard|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     Standard|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|      Premium|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|     Standard|
|       C008| Divya|  Chennai| 27|       45000|Electronics|     Standard|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|     Standard|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|     Standard|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|     Standard|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     Standard|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      Premium|
|       C021| Pooja|    Delhi| 27|       47000|   Clothing|     Standard|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|     Standard|
|       C026| Swati|    Delhi| 25|       46000|Electronics|     Standard|
|       C028| Anita|  Chennai| 26|       44000|   Clothing|     Standard|
|       C029|Sameer|Bangalore| 33|       68000|Electronics|     Standard|
+-----------+------+---------+---+------------+-----------+-------------+

#Convert the city name to uppercase using the upper() function.

In [27]:
from pyspark.sql.functions import upper
df.select(upper(df.city)).show(30)

+-----------+
|upper(city)|
+-----------+
|  HYDERABAD|
|    CHENNAI|
|  BANGALORE|
|      DELHI|
|     MUMBAI|
|  HYDERABAD|
|      DELHI|
|    CHENNAI|
|  BANGALORE|
|     MUMBAI|
|  HYDERABAD|
|      DELHI|
|    CHENNAI|
|     MUMBAI|
|  BANGALORE|
|      DELHI|
|  HYDERABAD|
|    CHENNAI|
|     MUMBAI|
|  BANGALORE|
|      DELHI|
|  HYDERABAD|
|    CHENNAI|
|  BANGALORE|
|     MUMBAI|
|      DELHI|
|  HYDERABAD|
|    CHENNAI|
|  BANGALORE|
|      DELHI|
+-----------+

#Remove the category column from the DataFrame.

In [28]:
df.drop("category").show()

+-----------+------+---------+---+------------+-------------+
|customer_id|  name|     city|age|annual_spend|customer_type|
+-----------+------+---------+---+------------+-------------+
|       C001| Arjun|Hyderabad| 25|       45000|     Standard|
|       C002| Meera|  Chennai| 32|       52000|     Standard|
|       C003|Rajesh|Bangalore| 29|       61000|     Standard|
|       C004| Priya|    Delhi| 22|       38000|     Standard|
|       C005|Sanjay|   Mumbai| 35|       72000|      Premium|
|       C006| Kavya|Hyderabad| 28|       48000|     Standard|
|       C007| Imran|    Delhi| 31|       53000|     Standard|
|       C008| Divya|  Chennai| 27|       45000|     Standard|
|       C009|  Anil|Bangalore| 40|       85000|      Premium|
|       C010|  Ritu|   Mumbai| 23|       39000|     Standard|
|       C011|  Hari|Hyderabad| 33|       56000|     Standard|
|       C012|  Sana|    Delhi| 26|       47000|     Standard|
|       C013|Vikram|  Chennai| 38|       91000|      Premium|
|       C014| Deepa|   Mumbai| 30|       62000|     Standard|
|       C015|  Asha|Bangalore| 24|       41000|     Standard|
|       C016| Kiran|    Delhi| 29|       59000|     Standard|
|       C017| Farah|Hyderabad| 36|       70000|     Standard|
|       C018| Tarun|  Chennai| 28|       53000|     Standard|
|       C019| Nisha|   Mumbai| 21|       35000|     Standard|
|       C020| Yusuf|Bangalore| 34|       76000|      Premium|
+-----------+------+---------+---+------------+-------------+
only showing top 20 rows

#Sort customers by age in descending order.

In [30]:
df.orderBy(df.age.desc()).show(30)

+-----------+------+---------+---+------------+-----------+-------------+
|customer_id|  name|     city|age|annual_spend|   category|customer_type|
+-----------+------+---------+---+------------+-----------+-------------+
|       C027|Mahesh|Hyderabad| 41|       90000|  Furniture|      Premium|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|      Premium|
|       C025|Gautam|   Mumbai| 39|       82000|  Furniture|      Premium|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|      Premium|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     Standard|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|      Premium|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      Premium|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|     Standard|
|       C029|Sameer|Bangalore| 33|       68000|Electronics|     Standard|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|     Standard|
|       C022|  Zara|Hyderabad| 32|       58000|    Grocery|     Standard|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|     Standard|
|       C023|  Ajay|  Chennai| 30|       51000|  Furniture|     Standard|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|     Standard|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|     Standard|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     Standard|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|     Standard|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|     Standard|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|     Standard|
|       C008| Divya|  Chennai| 27|       45000|Electronics|     Standard|
|       C021| Pooja|    Delhi| 27|       47000|   Clothing|     Standard|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|     Standard|
|       C028| Anita|  Chennai| 26|       44000|   Clothing|     Standard|
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     Standard|
|       C026| Swati|    Delhi| 25|       46000|Electronics|     Standard|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|     Standard|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|     Standard|
|       C030| Leela|    Delhi| 22|       36000|    Grocery|     Standard|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|     Standard|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|     Standard|
+-----------+------+---------+---+------------+-----------+-------------+

#Find customers who are younger than the average age of the entire dataset.

In [33]:
from pyspark.sql.functions import avg

average_age = df.select(avg("age")).collect()[0][0]
filtered_df = df.filter(df.age < average_age)
filtered_df.show()

+-----------+------+---------+---+------------+-----------+-------------+
|customer_id|  name|     city|age|annual_spend|   category|customer_type|
+-----------+------+---------+---+------------+-----------+-------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     Standard|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     Standard|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|     Standard|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|     Standard|
|       C008| Divya|  Chennai| 27|       45000|Electronics|     Standard|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|     Standard|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|     Standard|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|     Standard|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|     Standard|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|     Standard|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|     Standard|
|       C021| Pooja|    Delhi| 27|       47000|   Clothing|     Standard|
|       C024| Reema|Bangalore| 28|       49000|   Clothing|     Standard|
|       C026| Swati|    Delhi| 25|       46000|Electronics|     Standard|
|       C028| Anita|  Chennai| 26|       44000|   Clothing|     Standard|
|       C030| Leela|    Delhi| 22|       36000|    Grocery|     Standard|
+-----------+------+---------+---+------------+-----------+-------------+

#Display the top 5 highest spending customers.

In [34]:
df.orderBy(df.annual_spend.desc()).show(5)

+-----------+------+---------+---+------------+-----------+-------------+
|customer_id|  name|     city|age|annual_spend|   category|customer_type|
+-----------+------+---------+---+------------+-----------+-------------+
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|      Premium|
|       C027|Mahesh|Hyderabad| 41|       90000|  Furniture|      Premium|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|      Premium|
|       C025|Gautam|   Mumbai| 39|       82000|  Furniture|      Premium|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      Premium|
+-----------+------+---------+---+------------+-----------+-------------+
only showing top 5 rows

#Create a new DataFrame containing only customers from Mumbai.

In [35]:
df2=df.filter(df.city=="Mumbai")
df2.show()

+-----------+------+------+---+------------+-----------+-------------+
|customer_id|  name|  city|age|annual_spend|   category|customer_type|
+-----------+------+------+---+------------+-----------+-------------+
|       C005|Sanjay|Mumbai| 35|       72000|Electronics|      Premium|
|       C010|  Ritu|Mumbai| 23|       39000|   Clothing|     Standard|
|       C014| Deepa|Mumbai| 30|       62000|   Clothing|     Standard|
|       C019| Nisha|Mumbai| 21|       35000|    Grocery|     Standard|
|       C025|Gautam|Mumbai| 39|       82000|  Furniture|      Premium|
+-----------+------+------+---+------------+-----------+-------------+

#Extract the first letter of each name and store in a new column.

In [36]:
from pyspark.sql.functions import substring

df = df.withColumn("first_letter", substring(df.name, 1, 1))
df.show()

+-----------+------+---------+---+------------+-----------+-------------+------------+
|customer_id|  name|     city|age|annual_spend|   category|customer_type|first_letter|
+-----------+------+---------+---+------------+-----------+-------------+------------+
|       C001| Arjun|Hyderabad| 25|       45000|Electronics|     Standard|           A|
|       C002| Meera|  Chennai| 32|       52000|    Grocery|     Standard|           M|
|       C003|Rajesh|Bangalore| 29|       61000|   Clothing|     Standard|           R|
|       C004| Priya|    Delhi| 22|       38000|    Grocery|     Standard|           P|
|       C005|Sanjay|   Mumbai| 35|       72000|Electronics|      Premium|           S|
|       C006| Kavya|Hyderabad| 28|       48000|    Grocery|     Standard|           K|
|       C007| Imran|    Delhi| 31|       53000|   Clothing|     Standard|           I|
|       C008| Divya|  Chennai| 27|       45000|Electronics|     Standard|           D|
|       C009|  Anil|Bangalore| 40|       85000|  Furniture|      Premium|           A|
|       C010|  Ritu|   Mumbai| 23|       39000|   Clothing|     Standard|           R|
|       C011|  Hari|Hyderabad| 33|       56000|    Grocery|     Standard|           H|
|       C012|  Sana|    Delhi| 26|       47000|Electronics|     Standard|           S|
|       C013|Vikram|  Chennai| 38|       91000|  Furniture|      Premium|           V|
|       C014| Deepa|   Mumbai| 30|       62000|   Clothing|     Standard|           D|
|       C015|  Asha|Bangalore| 24|       41000|    Grocery|     Standard|           A|
|       C016| Kiran|    Delhi| 29|       59000|  Furniture|     Standard|           K|
|       C017| Farah|Hyderabad| 36|       70000|   Clothing|     Standard|           F|
|       C018| Tarun|  Chennai| 28|       53000|  Furniture|     Standard|           T|
|       C019| Nisha|   Mumbai| 21|       35000|    Grocery|     Standard|           N|
|       C020| Yusuf|Bangalore| 34|       76000|Electronics|      Premium|           Y|
+-----------+------+---------+---+------------+-----------+-------------+------------+
only showing top 20 rows

#Mask the customer_id.
Example: C001 â†’ ***01

In [37]:
from pyspark.sql.functions import concat, substring, lit, col

df = df.withColumn("masked_customer_id", concat(lit("***"), substring(col("customer_id"), 3, 2)))
df.select("customer_id", "masked_customer_id").show()

+-----------+------------------+
|customer_id|masked_customer_id|
+-----------+------------------+
|       C001|             ***01|
|       C002|             ***02|
|       C003|             ***03|
|       C004|             ***04|
|       C005|             ***05|
|       C006|             ***06|
|       C007|             ***07|
|       C008|             ***08|
|       C009|             ***09|
|       C010|             ***10|
|       C011|             ***11|
|       C012|             ***12|
|       C013|             ***13|
|       C014|             ***14|
|       C015|             ***15|
|       C016|             ***16|
|       C017|             ***17|
|       C018|             ***18|
|       C019|             ***19|
|       C020|             ***20|
+-----------+------------------+
only showing top 20 rows

#Create a new boolean column "is_senior" where age > 35.

In [38]:
from pyspark.sql.functions import when, col
df = df.withColumn("is_senior", when(col("age") > 35, True).otherwise(False))
df.select("name", "age", "is_senior").show()

+------+---+---------+
|  name|age|is_senior|
+------+---+---------+
| Arjun| 25|    false|
| Meera| 32|    false|
|Rajesh| 29|    false|
| Priya| 22|    false|
|Sanjay| 35|    false|
| Kavya| 28|    false|
| Imran| 31|    false|
| Divya| 27|    false|
|  Anil| 40|     true|
|  Ritu| 23|    false|
|  Hari| 33|    false|
|  Sana| 26|    false|
|Vikram| 38|     true|
| Deepa| 30|    false|
|  Asha| 24|    false|
| Kiran| 29|    false|
| Farah| 36|     true|
| Tarun| 28|    false|
| Nisha| 21|    false|
| Yusuf| 34|    false|
+------+---+---------+
only showing top 20 rows

#Count number of customers per city (uses groupBy).

In [39]:
df.groupBy("city").count().show()

+---------+-----+
|     city|count|
+---------+-----+
|Bangalore|    6|
|  Chennai|    6|
|   Mumbai|    5|
|    Delhi|    7|
|Hyderabad|    6|
+---------+-----+